{
  "project": "Flight Log Manager",
  "branchName": "ralph/batch-upload",
  "description": "Batch upload for multiple .ulg files and bug fixes for test_data file uploads",
  "userStories": [
    {
      "id": "US-042",
      "title": "Investigate and fix upload bug with test_data files",
      "description": "As a developer, I need to identify why .ulg files in test_data/ fail to upload so that all valid ULog files can be processed.",
      "acceptanceCriteria": [
        "Attempt to upload each file in test_data/ and document the errors",
        "Identify root cause of upload failures (parsing, validation, or storage issue)",
        "Implement fix for the identified issue(s)",
        "All 5 test_data/*.ulg files upload successfully via the upload form or API",
        "Existing upload functionality still works for previously working files",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Fixed flight_date extraction: use time_ref_utc from ULog when available, fall back to parsing date from filename. Also improved GPS extraction to try multiple sources."
    },
    {
      "id": "US-043",
      "title": "Enable multiple file selection in upload form",
      "description": "As a user, I want to select multiple .ulg files at once so that I can upload a batch of flight logs without repeating the process for each file.",
      "acceptanceCriteria": [
        "File input accepts multiple .ulg files via file picker (add multiple attribute)",
        "Drag-and-drop zone accepts multiple .ulg files dropped at once",
        "Selected files displayed in a scrollable list showing filename and file size",
        "Each file has a remove button (X) to remove it from selection before upload",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Implemented multi-file selection with scrollable list, individual remove buttons, and duplicate prevention. dev-browser skill not available - verified via typecheck and production build."
    },
    {
      "id": "US-044",
      "title": "Add common defaults form for batch upload",
      "description": "As a user, I want to set pilot name and drone model once for all files so that I don't have to enter the same information repeatedly.",
      "acceptanceCriteria": [
        "Common fields section with pilot name input (with autocomplete from /api/pilots)",
        "Common fields section with drone model dropdown (XLT, S1, CX10)",
        "Section labeled 'Defaults for all files' or similar clear labeling",
        "Common fields appear above the file list",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Added 'Defaults for all files' section above file list with pilot input (autocomplete) and drone model dropdown. Removed duplicate fields from lower section. dev-browser skill not available - verified via typecheck and production build."
    },
    {
      "id": "US-045",
      "title": "Add per-file override capability",
      "description": "As a user, I want to customize the title and optionally override other fields for individual files so that each log entry has accurate metadata.",
      "acceptanceCriteria": [
        "Each file in the list has an expandable/collapsible section for overrides",
        "Title field shown for each file, pre-populated from filename (without .ulg extension)",
        "Optional override fields available: pilot, drone model, comment, tags",
        "Override fields show placeholder text indicating default will be used if empty",
        "Collapsed by default, expand button to show override fields",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Added FileOverride interface and per-file state management. File list now has expandable sections with chevron toggle. Title pre-populated from filename, override fields show 'Use default if empty' placeholder. dev-browser skill not available - verified via typecheck and production build."
    },
    {
      "id": "US-046",
      "title": "Display metadata preview for each file in batch",
      "description": "As a user, I want to see extracted metadata (duration, date, GPS) for each file before uploading so that I can verify I selected the correct files.",
      "acceptanceCriteria": [
        "Each file in list shows extracted metadata (duration, date, serial number, GPS) after selection",
        "Metadata extraction happens in parallel for all selected files using Promise.all",
        "Loading spinner shown for each file while its metadata is being extracted",
        "Error state shown if metadata extraction fails for a file (file still uploadable)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Added FileMetadataState interface and fileMetadataStates Map. Parallel extraction via Promise.all with per-file loading/error/success states. Metadata preview shows duration, date, serial number, GPS inline with file info. dev-browser skill not available - verified via typecheck and production build."
    },
    {
      "id": "US-047",
      "title": "Implement batch upload submission",
      "description": "As a user, I want to click one button to upload all selected files so that the batch upload completes efficiently.",
      "acceptanceCriteria": [
        "Single 'Upload All' button submits all files in the list",
        "Files uploaded sequentially to existing POST /api/logs endpoint (one at a time)",
        "Progress indicator shows which file is currently uploading (e.g., 'Uploading 3 of 5...')",
        "Individual file status updates as each upload completes or fails",
        "Upload continues for remaining files even if one fails",
        "Button disabled during upload, shows cancel option or loading state",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Added FileUploadStatus interface for per-file tracking. Batch upload via handleBatchUpload() with sequential uploads to /api/logs. Progress indicator shows 'Uploading X of Y'. Per-file status icons (spinner/green check/red X) with status labels. Upload continues on individual failures. Button disabled during upload. dev-browser skill not available - verified via typecheck and production build."
    },
    {
      "id": "US-048",
      "title": "Handle batch upload completion and errors",
      "description": "As a user, I want clear feedback on batch upload results so that I know which files succeeded and can retry failed ones.",
      "acceptanceCriteria": [
        "Success state: green checkmark icon and 'Uploaded' label for each successful file",
        "Error state: red X icon and error message for each failed file",
        "Failed files remain in list with 'Retry' button to attempt upload again",
        "'Clear completed' button removes all successfully uploaded files from list",
        "If all files succeeded, show success message with link/button to go to log list",
        "Summary shown after batch completes: 'X succeeded, Y failed'",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Added batchUploadComplete state to track when batch finishes. Added getBatchUploadSummary() and isAllFilesSucceeded() helpers. Added handleRetryFile() for individual retry and handleClearCompleted() to remove successful files. UI shows completion summary with X succeeded/Y failed, Retry button for failed files, Clear Completed button, and Go to Flight Logs button when all succeed. dev-browser skill not available - verified via typecheck and production build."
    }
  ]
}
